joristork/robots/jobot_in_c/microchip_extras/h/p18f2685.h
extern volatile far  unsigned char       B1D7;
extern volatile far  struct {
  unsigned B1D70:1;
  unsigned B1D71:1;
  unsigned B1D72:1;
  unsigned B1D73:1;
  unsigned B1D74:1;
  unsigned B1D75:1;
  unsigned B1D76:1;
  unsigned B1D77:1;
} B1D7bits;
extern volatile far  unsigned char       CANSTAT_RO8;
extern volatile far  union {
  struct {
    unsigned EICODE0:1;
    unsigned EICODE1_ICODE0:1;
    unsigned EICODE2_ICODE1:1;
    unsigned EICODE3_ICODE2:1;
    unsigned EICODE4:1;
    unsigned OPMODE0:1;
    unsigned OPMODE1:1;
    unsigned OPMODE2:1;
  };
  struct {
    unsigned ICODE0:1;
    unsigned ICODE1:1;
    unsigned ICODE2:1;
    unsigned ICODE3:1;
    unsigned ICODE4:1;
  };
} CANSTAT_RO8bits;
extern volatile far  unsigned char       CANCON_RO8;
extern volatile far  union {
  struct {
    unsigned FP0:1;
    unsigned WIN0_FP1:1;
    unsigned WIN1_FP2:1;
    unsigned WIN2_FP3:1;
    unsigned ABAT:1;
    unsigned REQOP0:1;
    unsigned REQOP1:1;
    unsigned REQOP2:1;
  };
  struct {
    unsigned :1;
    unsigned WIN0:1;
    unsigned WIN1:1;
    unsigned WIN2:1;
  };
} CANCON_RO8bits;
extern volatile far  unsigned char       B2CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
  struct {
    unsigned :5;
    unsigned RXRTRRO:1;
  };
} B2CONbits;
extern volatile far  unsigned char       B2SIDH;
extern volatile far  struct {
  unsigned SID3:1;
  unsigned SID4:1;
  unsigned SID5:1;
  unsigned SID6:1;
  unsigned SID7:1;
  unsigned SID8:1;
  unsigned SID9:1;
  unsigned SID10:1;
} B2SIDHbits;
extern volatile far  unsigned char       B2SIDL;
extern volatile far  union {
  struct {
    unsigned EID16:1;
    unsigned EID17:1;
    unsigned :1;
    unsigned EXIDE:1;
    unsigned SRR:1;
    unsigned SID0:1;
    unsigned SID1:1;
    unsigned SID2:1;
  };
  struct {
    unsigned :3;
    unsigned EXID:1;
  };
} B2SIDLbits;
extern volatile far  unsigned char       B2EIDH;
extern volatile far  struct {
  unsigned EID8:1;
  unsigned EID9:1;
  unsigned EID10:1;
  unsigned EID11:1;
  unsigned EID12:1;
  unsigned EID13:1;
  unsigned EID14:1;
  unsigned EID15:1;
} B2EIDHbits;
extern volatile far  unsigned char       B2EIDL;
extern volatile far  struct {
  unsigned EID0:1;
  unsigned EID1:1;
  unsigned EID2:1;
  unsigned EID3:1;
  unsigned EID4:1;
  unsigned EID5:1;
  unsigned EID6:1;
  unsigned EID7:1;
} B2EIDLbits;
extern volatile far  unsigned char       B2DLC;
extern volatile far  union {
  struct {
    unsigned DLC0:1;
    unsigned DLC1:1;
    unsigned DLC2:1;
    unsigned DLC3:1;
    unsigned RB0:1;
    unsigned RB1:1;
    unsigned RXRTR_TXRTR:1;
  };
  struct {
    unsigned :4;
    unsigned RESRB0:1;
    unsigned RESRB1:1;
    unsigned TXRTR:1;
  };
  struct {
    unsigned :6;
    unsigned RXRTR:1;
  };
} B2DLCbits;
extern volatile far  unsigned char       B2D0;
extern volatile far  struct {
  unsigned B2D00:1;
  unsigned B2D01:1;
  unsigned B2D02:1;
  unsigned B2D03:1;
  unsigned B2D04:1;
  unsigned B2D05:1;
  unsigned B2D06:1;
  unsigned B2D07:1;
} B2D0bits;
extern volatile far  unsigned char       B2D1;
extern volatile far  struct {
  unsigned B2D10:1;
  unsigned B2D11:1;
  unsigned B2D12:1;
  unsigned B2D13:1;
  unsigned B2D14:1;
  unsigned B2D15:1;
  unsigned B2D16:1;
  unsigned B2D17:1;
} B2D1bits;
extern volatile far  unsigned char       B2D2;
extern volatile far  struct {
  unsigned B2D20:1;
  unsigned B2D21:1;
  unsigned B2D22:1;
  unsigned B2D23:1;
  unsigned B2D24:1;
  unsigned B2D25:1;
  unsigned B2D26:1;
  unsigned B2D27:1;
} B2D2bits;
extern volatile far  unsigned char       B2D3;
extern volatile far  struct {
  unsigned B2D30:1;
  unsigned B2D31:1;
  unsigned B2D32:1;
  unsigned B2D33:1;
  unsigned B2D34:1;
  unsigned B2D35:1;
  unsigned B2D36:1;
  unsigned B2D37:1;
} B2D3bits;
extern volatile far  unsigned char       B2D4;
extern volatile far  struct {
  unsigned B2D40:1;
  unsigned B2D41:1;
  unsigned B2D42:1;
  unsigned B2D43:1;
  unsigned B2D44:1;
  unsigned B2D45:1;
  unsigned B2D46:1;
  unsigned B2D47:1;
} B2D4bits;
extern volatile far  unsigned char       B2D5;
extern volatile far  struct {
  unsigned B2D50:1;
  unsigned B2D51:1;
  unsigned B2D52:1;
  unsigned B2D53:1;
  unsigned B2D54:1;
  unsigned B2D55:1;
  unsigned B2D56:1;
  unsigned B2D57:1;
} B2D5bits;
extern volatile far  unsigned char       B2D6;
extern volatile far  struct {
  unsigned B2D60:1;
  unsigned B2D61:1;
  unsigned B2D62:1;
  unsigned B2D63:1;
  unsigned B2D64:1;
  unsigned B2D65:1;
  unsigned B2D66:1;
  unsigned B2D67:1;
} B2D6bits;
extern volatile far  unsigned char       B2D7;
extern volatile far  struct {
  unsigned B2D70:1;
  unsigned B2D71:1;
  unsigned B2D72:1;
  unsigned B2D73:1;
  unsigned B2D74:1;
  unsigned B2D75:1;
  unsigned B2D76:1;
  unsigned B2D77:1;
} B2D7bits;
extern volatile far  unsigned char       CANSTAT_RO7;
extern volatile far  union {
  struct {
    unsigned EICODE0:1;
    unsigned EICODE1_ICODE0:1;
    unsigned EICODE2_ICODE1:1;
    unsigned EICODE3_ICODE2:1;
    unsigned EICODE4:1;
    unsigned OPMODE0:1;
    unsigned OPMODE1:1;
    unsigned OPMODE2:1;
  };
  struct {
    unsigned ICODE0:1;
    unsigned ICODE1:1;
    unsigned ICODE2:1;
    unsigned ICODE3:1;
    unsigned ICODE4:1;
  };
} CANSTAT_RO7bits;
extern volatile far  unsigned char       CANCON_RO7;
extern volatile far  union {
  struct {
    unsigned FP0:1;
    unsigned WIN0_FP1:1;
    unsigned WIN1_FP2:1;
    unsigned WIN2_FP3:1;
    unsigned ABAT:1;
    unsigned REQOP0:1;
    unsigned REQOP1:1;
    unsigned REQOP2:1;
  };
  struct {
    unsigned :1;
    unsigned WIN0:1;
    unsigned WIN1:1;
    unsigned WIN2:1;
  };
} CANCON_RO7bits;
extern volatile far  unsigned char       B3CON;
extern volatile far  union {
  struct {
    unsigned FILHIT0_TXPRI0:1;
    unsigned FILHIT1_TXPRI1:1;
    unsigned FILHIT2_RTREN:1;
    unsigned FILHIT3_TXREQ:1;
    unsigned FILHIT4_TXERR:1;
    unsigned RXRTRRO_TXLARB:1;
    unsigned RXM1_TXABT:1;
    unsigned RXFUL_TXBIF:1;
  };
  struct {
    unsigned FILHIT0:1;
    unsigned FILHIT1:1;
    unsigned FILHIT2:1;
    unsigned FILHIT3:1;
    unsigned FILHIT4:1;
    unsigned RTRRO:1;
    unsigned RXM1:1;
    unsigned RXFUL:1;
  };
  struct {
    unsigned TXPRI0:1;
    unsigned TXPRI1:1;
    unsigned RTREN:1;
    unsigned TXREQ:1;
    unsigned TXERR:1;
    unsigned TXLARB:1;
    unsigned TXABT:1;
    unsigned TXBIF:1;
  };
  struct {
    unsigned :5;
    unsigned RXRTRRO:1;
  };
} B3CONbits;
